---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile
source: html/4af9877e-b3a3-9588-9021-32ab80022344.htm
---
# StructuralSectionSigmaProfile Members

Creates a new instance of Structural Section Sigma Profile shape with the associated set of parameters,
 used to attach to structural element.